package RRS;

public class Homework_1 {
    void displayInfo() {
        System.out.println("------------------------------------------------------------------------");
        System.out.println("-----------------------------= HOMEWORK 1 =-----------------------------");
        System.out.println("-------------------------------= Task 1 =-------------------------------");
        System.out.println("Условие:");
        System.out.println(
                "Написать программу, которая будет печатать/выводить следующий текст:\n" +
                "3\n" +
                "2\n" +
                "1\n" +
                "Поехали!!!\n");
        System.out.println("------------------------------------------------------------------------");
        System.out.println("-------------------------------= Task 2 =-------------------------------");
        System.out.println("Результат:");
        System.out.println(
                "3\n" +
                "2\n" +
                "1\n" +
                "Поехали!!!\n");
        System.out.println("------------------------------------------------------------------------");
        System.out.println("-------------------------------= Task 3 =-------------------------------");
        System.out.println("Результат: \uD83D\uDE3A");
    }
}