package RRS;

public class Homework_5 {
    void displayInfo() {
        System.out.println("------------------------------------------------------------------------");
        System.out.println("-----------------------------= HOMEWORK 5 =-----------------------------");
        System.out.println("-------------------------------= Task 1 =-------------------------------");
        System.out.println("""
                Условие:
                Дан массив: int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
                1. необходимо вывести сумму всех элементов массива
                2. необходимо вывести максимальное значение элементов массива
                3. необходимо вывести минимальное значение элементов массива
                4. необходимо вывести среднее арифметическое всех элементов массива
                """);
        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
        int sum = 0;
        int max = array[0];
        int min = 0;
        float arithmetic = 0;

        // Ищем сумму:
        for (int i : array) {
            sum = sum + i;
        }
        // Ищем максимальное значение:
        for (int i : array){
            if(i > max){max = i;}
        }
        // Ищем инимально значение:
        for (int i : array){
            if(i < min){min = i;}
        }
        // Ищем среднее арифметическое всех значений массива

        arithmetic = sum / array.length;

        System.out.println("Cумма всех элементов массива равна: " + sum);
        System.out.println("Максимальное значение массива равно: " + max);
        System.out.println("Минимальное значение массива равно: " + max);
        System.out.println("Среднее арифметическое всех элементов массива равно: " + arithmetic);
        System.out.println("------------------------------------------------------------------------");
        System.out.println();
        System.out.println("-------------------------------= Task 2 =-------------------------------");
        System.out.println("""
                Условие:
                Дан массив: int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
                1. необходимо вывести сумму элементов массива
                2. необходимо вывести максимальное значение массива
                3. необходимо вывести количество элементов в массиве
                """);

        int[][] array2 = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};

        // Ищем сумму:
        int sum_2 = 0;
        int max_2 = array2[0][0];
        int count = 0;
        for (int[] i : array2){
            for (int j : i){
                sum_2 = sum_2 + j;
            }
        }
        // Ищем максимальное значение:
        for (int[] i : array2){
            for (int j : i){
                if(j > max_2){ max_2 = j;}
            }
        }
        // Ищем количество элементов в массиве:
        for (int[] i : array2){
            for (int j : i){
                count++;
            }
        }
        System.out.println("Cумма всех элементов массива равна: " + sum_2);
        System.out.println("Максимальное значение массива равна: " + max_2);
        System.out.println("Количество элементов макссива равно: " + count);
        System.out.println("------------------------------------------------------------------------");
        System.out.println();
        System.out.println("-------------------------------= Task 3------------------------------");
        System.out.println("""
                Условие:
                Дан массив: int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
                1. необходимо вывести сумму элементов массива
                2. необходимо вывести максимальное значение массива
                3. необходимо вывести количество элементов в массиве
                """);
    }
}
